var Question= document.getElementById("Question");
var Enter_Answer = document.getElementById("Enter_Answer");
var Remove = document.getElementById("Remove");
var Answer = document.getElementById("Answer");

Enter_Answer.addEventListener("click" , ()=>{
    answer();
})

function answer(){
    if(Question.value == "ما هي البرمجة" || Question.value == "ما هي البرمجه"){
        Answer.innerHTML = "البرمجة هي عملية كتابة تعليمات وتوجيه أوامر لجهاز الحاسوب أو أي جهاز آخر مثل قارئات أقراص الدي في دي أو أجهزة استقبال الصوت والصورة في نظم الاتصالات الحديثة، لتوجيه هذا الجهاز وإعلامه بكيفية التعامل مع البيانات أو كيفية تنفيذ سلسلة من الأعمال المطلوبة تسمى خوارزمية.";
    }else if(Question.value == "من هم الانينموس" || Question.value == "من هم الأنينموس"){
        Answer.innerHTML = "هي مجموعة قلة تعمل في مجال النضال عبر الاختراق البرمجي. ولقد وُجدت عام 2003م على منتدى الصور (4 تشان)، تمثل مفهومًا لمستخدمي شبكة الإنترنت وغير موجودين في مكان واحد معًا، ولكنهم كمجتمعات يُطلق عليها مجازًا الدماغ العالمي الرقمي اللاسلطوي، وأيضاً تُعتبر بشكل عام مصطلح مُبطن لأعضاء من جماعات اجتماعية منعزلة في شبكة الإنترنت، كطريقة للإشارة لأعمالٍ تعارض الرقابة والإشراف في الإنترنت بشدة لأشخاص في بيئة تمثل هويتهم الحقيقية، ولقد قاموا باختراق العديد من المواقع الحكومية وكذلك اخترقوا أنظمة حاسوب أهم شركات الحماية، ويُمكن تمييز أعضائهم في المجتمع عن طريق ارتدائهم لنمط معين من الأقنعة يسمى (جاي فوكس) وهي بالأصل صُممت لفلم V للثأر عام 2005م";
    }else if(Question.value == "ما هي ال Javascript" || Question.value == "ما هي ال JavaScript"){
        Answer.innerHTML = "جافا سكريبت أو في الغالب كاختصارا JS ‏ هي لغة برمجة عالية المستوى تستخدم أساساً في متصفحات الويب لإنشاء صفحات أكثر تفاعلية. يتم تطويرها حالياً من طرف شركة موزيلا"
    }else if(Question.value == "ما هو الفرق بين Oracle و SQL Server"){
        Answer.innerHTML = "الفرق الرئيسي هو أن الــ SQL Server خاص بالــ Windows أما الــ Oracle فهو متعدد المنصات (Cross-platform). و من ناحية سهولة الإستخدام : التعامل مع الــ SQL Server أبسط من التعامل مع الأورا لأن أدوات و تقنيات Mico مثل Net, ADO.Net, MSDTC, etc. تكون متوافقة مع SQL Server أكثر من أي DBMS آخر. و يمتلك الــ SQL Server واجهة رسومية جميلة و سهلة التعامل. و يستطيع الأوراكل تسيير قواعد بيانات ضخمة جدا على عكس الــ SQL Server."
    }else{
        Answer.innerHTML = "هذا السؤال غير موجود في قاعدة البيانات"
    }
}
Remove.addEventListener("click", ()=>{
    Question.value = "";
    Answer.value = "";
})